
# coding: utf-8




name = input("Please enter your name: ")

print('hello ' + name + ' I want to tell you some story')





print(name + ''', Ви заблукали в темному лісі. 
Перед Вами дві стежки. Одна веде наліво, де вдалечині Ви бачите зелену, вкриту квітами галявину. 
Друга веде в непрохідні хащі. І звісно Ви не можете залишатися на одном місці, 
тому Вам потрібно обрати свій шлях.

    a) Ліворуч. 
    b) Праворуч 
    ''')
value1 = ''
while True:
    print('Оберіть варіант (a) або (b)')
    value1 = input()
    if value1 != 'a' and value1 != 'b':
        continue
    print('Ви впевнені? ☺ [y/n]')
    pa1 = input()
    if pa1 == 'y':
        break
print('Розпочнемо нашу подорож')

value2 = ''
value3 = ''
value4 = ''
value5 = ''
value6 = ''
value7 = ''
value8 = ''





if value1 == 'a':   
    print('''Після тривалої проглянки Ви потрапили на невеличку але надзвичайно красиву галявину. 
        Ви ще не впевнені, що будете робити далі але посередині 
        полянки Ви бачите декілька кущів малини. Ви ДУЖЕ давно нічого не їли! 

         Чи підети Ви ближче до кущів та поїсте?

            a)Так, піду попоїм.
            b)Ні продовжу йти далі.''')

    value2 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value2 = input()
        if value2 != 'a' and value2 != 'b':
            continue
        print('Ви обрали варіант ' + value2)
        pa21 = 'a'    
        if pa21 == value2:
            print('Ви вирішили підійти ближче до кущів та оглянути їх.')
        break
    pa2 = 'b'
    if pa2 == value2:
        print('''
        Ви ще декільки днів продовжували свою подорож але не знайшли жодної їжі((. 
            Так, на жаль Ви не вижили.
            Кінець.''')
        





if value1 == 'b':
    print('''Ви обрали дуже не простий тернистий шлях через непрохідні хащі.
            Але прийдеться змиритися та вирушати в дорогу.
            Треба якось пробиратися через зарослі лісу, тому Ви підібрали палку,
            щоб полегшити собі шлях.
            Близько двох годин Ви йшли через темні хащі і натрапили на неочікувану знахідку.
            Перед Вами хатина, стара але доглянута, в середині горить світло від каміну.
            
            Що ж Ви вирішите?
                а)Постукати в двері хати.
                b)Продовжити подорож та і не дізнавшись, що чи хто в хатині.
                ''')
    
    value4 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value4 = input()
        if value4 != 'b': #and value4 != 'b':
            print('Ви обрали варіант ' + value4)
        pa41 = 'b'    
        if pa41 == value4:
            print('''Справді?? Ви вирішили, що поцікавитися хто в хаті - це погана ідея? 
            І продовжити подорож в невідомому напрямку це правильно?
            Нехай так, давайте спробуємо...''')
            print('''
            Ви знов довго блукали хащами і вийшли до хати.
            Що ж постукаєте в двері? Чи спробуєте пройти мимо. ''')
        if value4 != 'a':
             continue
        pa4 = 'a'
        if pa4 == value4:
            print('''
            Ви знайшли двері та легенько постукали.
                Кхе...Кхе...Ви почули що всередині хтось покашляв та почав наближатися до дверей.''')
        break
        





if value2 == 'a':
    print(''' Так справді це кущі чудових та смачних ягід малини.
        Ви смачно поЇли і вирішили.....
        Ой лишенько... Аууу ууууу... З-за кущів на вас виглядає великий вовк, 
        який також не проти Вами перекусити.
        
        Що Ви робитимете?
            
            a)Ви залишитеся і спробуєте домовитися з вовком.
            b)Ви будете тікати, вкладаючи всі свої сили.
            
            ''')
    value3 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value3 = input()
        if value3 != 'a' and value3 != 'b':
            continue
        print('Ви обрали варіант ' + value3)
        pa31 = 'a'    
        if pa31 == value3:
            print('''
            Ви зупинилися і впевнено подивилися вовку в очі. 
                Вовк гордо та повільно підходить до вас!''')
        break
    pa3 = 'b'
    if pa3 == value3:
        print('''
        Ви пробігли вже близько 1 кілометра але вовк продовжує вас наздоганяти.
            Ви розумієте, що він витриваліший за Вас.
            На жаль Ви не змогли втекти.(
                Кінець.''')
        
if value2 != 'a':
    print('')
    





if value4 == 'a':
    print(''' Двері відкрилися і Ви побачили старого чоловіка. 
    Ви привіталися. Чоловік виявися лісорубом який вже багато років живе та доглядає цей старий ліс.
    Він поділився з Вами вечерею та дозволив переночувати в своїй хатині.
    
    Зранку, коли ви прокинулися, лісоруб вже приготував сніданок, та сказав Вам, що допоможе вийти з лісу.
    Проте також він розповів вам про один цікавий скарб, але лісоруб не міг сам його дістати і 
    поцікавився чи не допоможете Ви йому?
    
    Вирішуйте що робити:
    
        а)Вас зацікавила історія про скарб і Ви вирушите з лісорубом в подорож.
        b)Ви просто попросите показати вихід з лісу і підете додому спати.
        
        ''')
    value5 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value5 = input()
        if value5 != 'a' and value5 != 'b':
            continue
        print('Ви обрали варіант ' + value5)
        pa51 = 'a'    
        if pa51 == value5:
            print('''
            Ви рушаєте в дорогу зібравши припаси.
                    Що ж, на пошуки скарбів!!!''')
        break
    pa5 = 'b'
    if pa5 == value5:
        print('''
        Лісоруб виявся поганою людиною( 
        і завжди носив з собою сокиру!  Додому спати Ви не підете(
            На жаль Ви не змогли втекти.(
                Кінець.''')
    
    
if value4 != 'a':
    print('')
    





if value3 == 'a':
    print('''Великий та поважний вовк підійшов до Вас дуже близько.
          Після невеликої паузи, яка тривала для вас вічність, вовк заговорив до Вас.
          
          Спочатку ви звісто подумали, що ягоди, які ви їли були не прості ))
          Але у Вас не залишалося іншого вибору і Ви відповіли.
          
          вовк:"Привіт, хто гуляє в моєму лісі?"
          
          Ви:"Привіт, мене звати ''' + name + ''' я заблукав.
          
          вовк:"Радий знайомству. Мене звати Убу, я володар цього лісу!"
          
          Ви:"Чому ти мене не зʼїв? Ти допоможеш мені вийти з лісу?"
          
          Убу:"Ти мені сподобався, я не зʼїв тебе через твою хоробрість!
            Так я допоможу тобі. Але спочтку подарую цінну річ (скарб) внаслідок нашого знайомства,
            щоб ти не забував про мене!"
           
           
            Вирішуйте:
                а)Довіритесь Ви вовку? Чи це чарівна дія ягід.
                b)Ні аааа...  Я тікатиму!
                
            ''')
    
    value6 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value6 = input()
        if value6 != 'a' and value6 != 'b':
            continue
        print('Ви обрали варіант ' + value6)
        pa61 = 'a'    
        if pa61 == value6:
            print('''
            Ви погодилися на пропозицію вовка.
                І вирушили в нову пригоду на пошуки скарбу. ''')
        break
    pa6 = 'b'
    if pa6 == value6:
        print('''
        Ви пробігли вже близько 1 кілометра але вовк продовжує вас наздоганяти.
            Ви розумієте, що він витриваліший за Вас.
            На жаль Ви не змогли втекти.(
                Кінець.''')
        
if value3 != 'a':
    print('')





if value6 == 'a':
    print('''Ви декілька годин подорожували в компанії вовка.
    Убу розповів вам багато цікавих історій.
    
    Нарешті ви дійшли до місця призначення.
    Це була невелика печера в середині якої був глечик з чарівною водою,
    випивши яку Ви б ніколи не хворіли.
    
    Вовк дозволив вам випити з глечика. І поклав його в свою торбину.
    
    Убу не забув своєї обіццянки і ви вирушили до виходу з лісу.
    
    Ого ви вийшли й печери, де вас зустрів старий лісоруб з сокирую.
    Він сказав що вовк надурив вас і він повинен померти, а глечик належить лісорубу.
    Лісоруб:"Я допоможу тобі вийти з лісу, та жити щасливо!"
    
    Ви зрозуміли, що Убу та чоловік знають один одного. 
    Вовк розізлився і сказав:"Не вір цьому лісорубу він злий чаклун,
    а глечик йому потрібен, щоб робити темні справи".
    
    Ви зрозуміли що повинні обрати кому допомогти, адже хтось з цих двох 
    давніх друзів не переживе цю зутріч.
    
    От і настав час зробити важкий вибір:
    
        а)Допомогти вовку Убу, перемогти лісоруба.
        b)Допомогти лісорубу впоратися з хижим звіром.
        
        ''')
    value8 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value8 = input()
        if value8 != 'a' and value8 != 'b':
            continue
        print('Ви обрали варіант ' + value8)
        pa81 = 'a'    
        if pa81 == value8:
            print('''
            Ви допомогли премогти лісоруба!
            Вітаю, ''' + name + ''' це премога!!!
            Убу вивів вас з лісу, та подякував за допомогу.
            !!! WINNER !!!''')
        break
    pa8 = 'b'
    if pa8 == value8:
        print('''
        Ви допомогли перемогти вовка!
        І шкодуєте про це( Так як лісоруб справді був лихим чаклуном 
        та поганою людиною.
        Ви також не покинули більше печери, 
        Вас спіткала доля Убу.
        Кінець.''')
        
if value6 != 'a':
    print('')
    




if value5 == 'a':
    print('''Ви декілька годин подорожували в компанії лісоруба.
    Чоловік розповів вам багато цікавих історій.
    
    Нарешті ви дійшли до місця призначення.
    Це була невелика печера в середині якої був глечик з чарівною водою,
    випивши яку Ви б ніколи не хворіли.
    
    Лісоруб забрав глечик та поклав його в свою торбину.
    
    Ого ви вийшли й печери, де вас зустрів велий поважний вовк.
    Вовк сказав:" Мене звати Убу я володар лісу! Не вір цьому лісорубу він злий чаклун,
    а глечик йому потрібен, щоб робити темні справи".
    
    Лісоруб заперечив слова вовка та відповів:"Не можна вірити цьому псу!
    Він звичайна не розумна тварина. Вовк просто шукає здобич.
    Він тебе зʼїсть".

    
    Ви зрозуміли що повинні обрати кому допомогти, адже хтось з цих двох 
    давніх друзів не переживе цю зутріч.
    
    От і настав час зробити важкий вибір:
    
        а)Допомогти вовку Убу, перемогти лісоруба.
        b)Допомогти лісорубу впоратися з хижим звіром.
         ''')
    
    value7 = ''
    while True:
        print('Оберіть варіант (a) або (b)')
        value7 = input()
        if value7 != 'a' and value7 != 'b':
            continue
        print('Ви обрали варіант ' + value7)
        pa71 = 'a'    
        if pa71 == value7:
            print('''
            Ви допомогли премогти лісоруба!
            Вітаю, ''' + name + ''' це премога!!!
            Вовк дозволив вам випити з глечика.
            Убу вивів вас з лісу, та подякував за допомогу.
            !!! WINNER !!!''')
        break
    pa7 = 'b'
    if pa7 == value7:
        print('''
        Ви допомогли перемогти вовка!
        І шкодуєте про це( Так як лісоруб справді виявився лихим чаклуном 
        та поганою людиною.
        Ви також не покинули більше печери, 
        Вас спіткала доля Убу.
        Кінець.''')
        
if value5 != 'a':
    print('')
    
